Show / Hide Table of Contents
Class AutomationHosting<MyInterface, ClientInterface>
Responsible of hosting an automation service on net.pipe endpoint
Inheritance
System.Object
AutomationHosting<MyInterface, ClientInterface>
Implements
IBIMPluginClient<ClientInterface>
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class AutomationHosting<MyInterface, ClientInterface> : IBIMPluginClient<ClientInterface>, IDisposable where MyInterface : class where ClientInterface : class
Type Parameters
 Name |  Description
 MyInterface
 ClientInterface
Constructors
Improve this Doc   View Source
AutomationHosting(MyInterface, IPluginLogger, String, String, String)
Declaration
public AutomationHosting(MyInterface hostedService, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent", string clientUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}", string automationUrlFormat = "net.pipe://localhost/IdeaStatiCaAuto{0}")
Parameters
 Type |  Name |  Description
 MyInterface |  hostedService
 IPluginLogger |  logger
 System.String |  eventName
 System.String |  clientUrlFormat
 System.String |  automationUrlFormat
Properties
Improve this Doc   View Source
HostingTask
Declaration
public Task HostingTask { get; set; }
Property Value
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
MyBIM
Declaration
public ClientInterface MyBIM { get; }
Property Value
 Type |  Description
 ClientInterface
Improve this Doc   View Source
Service
Declaration
public MyInterface Service { get; }
Property Value
 Type |  Description
 MyInterface
Improve this Doc   View Source
ServiceBaseAddress
Declaration
public string ServiceBaseAddress { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Status
Declaration
public AutomationStatus Status { get; }
Property Value
 Type |  Description
 AutomationStatus
Methods
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Improve this Doc   View Source
NotifyBIMStatusChanged(AppStatus)
Declaration
protected virtual void NotifyBIMStatusChanged(AppStatus newStatus)
Parameters
 Type |  Name |  Description
 AppStatus |  newStatus
Improve this Doc   View Source
RunAsync(String)
Declaration
public Task RunAsync(string id)
Parameters
 Type |  Name |  Description
 System.String |  id
The identifier if BIM application (its process id)
Returns
 Type |  Description
 System.Threading.Tasks.Task
Running task.
Improve this Doc   View Source
RunServer(String, CancellationToken)
Declaration
protected virtual void RunServer(string id, CancellationToken cancellationToken)
Parameters
 Type |  Name |  Description
 System.String |  id
 System.Threading.CancellationToken |  cancellationToken
Improve this Doc   View Source
Stop()
Declaration
public void Stop()
Events
Improve this Doc   View Source
BIMStatusChanged
Declaration
public event ISEventHandler BIMStatusChanged
Event Type
 Type |  Description
 ISEventHandler
Implements
 IBIMPluginClient<T>
 System.IDisposable
 Improve this Doc
 View Source